import React, { useState } from 'react';
import { Box, Typography, Link } from '@mui/material';
import Breadcrumbs from '../../layout/Breadcrumbs';
import FaqTab from './FaqTab';
import FaqItem from './FaqItem';
import './faq.css';

export default function Faq() {
    const [selectedTab, setSelectedTab] = useState(0);

    const handleTabChange = (newValue) => {
        setSelectedTab(newValue);
    };

    const faqParents = [
        { question: "Ποια είναι τα κριτήρια επιλεξιμότητας;", answer: "Η δυνατότητα πρόσβασης στις υπηρεσίες της πλατφόρμας εξαρτάται από το εισόδημα και την κατάσταση της οικογένειας. Αν πληρείτε τα κριτήρια επιλεξιμότητας, θα έχετε την δυνατότητα να χρησιμοποιήσετε την πλατφόρμα για να βρείτε και να συνεργαστείτε με νταντάδες που καλύπτουν τις ανάγκες σας." },
        { question: "Ποια διαδικασία πρέπει να ακολουθήσω;", answer: "Αρχικά, πρέπει να αναζητήσετε μια νταντά με βάση τις ανάγκες σας και τα κριτήρια που επιλέγετε (π.χ. ωράρια, εμπειρία). Στη συνέχεια, θα πρέπει να κανονίσετε ένα ραντεβού γνωριμίας, το οποίο μπορεί να γίνει είτε δια ζώσης είτε διαδικτυακά. Όταν βρείτε μια νταντά που σας ταιριάζει, θα πρέπει να δημιουργήσετε μια αίτηση και να την στείλετε. Αφού υπογράψετε το συμφωνητικό, η συνεργασία θα ξεκινήσει και θα διαρκέσει για τον μήνα που έχετε συμφωνήσει." },
        { question: "Τι κάνω στο τέλος της συνεργασίας;", answer: "Στο τέλος της συνεργασίας, πρέπει να πάτε στη \"τρέχουσα συνεργασία\" σας και να την ολοκληρώσετε. Έτσι, η νταντά θα μπορέσει να πληρωθεί και εσείς θα έχετε την δυνατότητα να ξεκινήσετε μια νέα συνεργασία με μια άλλη νταντά, εφόσον το επιθυμείτε. Μην ξεχάσετε να αφήσετε και μια κριτική για την εμπειρία σας με τη νταντά!" },
        { question: "Τι λειτουργίες παρέχει η πλατφόρμα;", answer: "Η πλατφόρμα παρέχει μια τεράστια ομάδα νταντάδων που μπορείτε να επιλέξετε για μερική ή πλήρη απασχόληση, για να φροντίζουν τα παιδιά σας με ασφάλεια. Είτε πρόκειται για καθημερινή φύλαξη είτε για ειδικές ανάγκες, η πλατφόρμα εξασφαλίζει μια ασφαλή και ευέλικτη εμπειρία για τους γονείς." }
    ];

    const faqNannies = [
        { question: "Ποια είναι τα κριτήρια επιλεξιμότητας;", answer: "Η πλατφόρμα είναι ανοιχτή σε όλους όσοι έχουν εμπειρία στη φροντίδα παιδιών ή κάποιο σχετικό πτυχίο. Το βασικότερο είναι να έχετε όρεξη για δουλειά και να αγαπάτε αυτό που κάνετε, ώστε να παρέχετε ποιοτική φροντίδα στα παιδιά." },
        { question: "Ποια διαδικασία πρέπει να ακολουθήσω;", answer: "Ξεκινήστε δημιουργώντας το προφίλ σας και στη συνέχεια δημοσιεύστε την αγγελία σας για τις υπηρεσίες που προσφέρετε. Όταν κάποιοι γονείς ενδιαφερθούν, θα σας στείλουν αίτημα για ραντεβού γνωριμίας, το οποίο μπορείτε να αποδεχθείτε ή να απορρίψετε. Εφόσον συμφωνήσετε να συνεργαστείτε, ο γονέας θα σας στείλει το συμφωνητικό συνεργασίας, το οποίο υπογράφετε για να ξεκινήσει η συνεργασία σας." },
        { question: "Τι κάνω στο τέλος της συνεργασίας;", answer: "Μετά την ολοκλήρωση της συνεργασίας από τον γονέα, θα πρέπει να επιβεβαιώσετε ότι έχετε λάβει το voucher πληρωμής σας μέσω της πλατφόρμας. Μόλις γίνει αυτό, μπορείτε να προχωρήσετε σε νέες συνεργασίες με άλλους γονείς που ενδιαφέρονται για τις υπηρεσίες σας." },
        { question: "Τι λειτουργίες παρέχει η πλατφόρμα;", answer: "Η πλατφόρμα σας επιτρέπει να προβάλλετε το προφίλ σας σε εκατοντάδες γονείς, να διαχειρίζεστε αιτήσεις συνεργασίας, να επικοινωνείτε με γονείς, και να οργανώνετε το πρόγραμμά σας εύκολα. Παρέχει επίσης εργαλεία για την ασφαλή υπογραφή συμφωνητικών και τη διασφάλιση των πληρωμών σας." }
    ];

    const faqs = selectedTab === 0 ? faqParents : faqNannies;

    return (
        <>
            <Breadcrumbs current="Συχνές Ερωτήσεις" />
            <Box className='faq-container' sx={{ display: 'flex', flexDirection: 'column', alignItems: 'center', marginBottom: '2rem' }}>
                <h1>Συχνές Ερωτήσεις</h1>
                <FaqTab onTabChange={handleTabChange} />
                <Box sx={{ width: '80%', maxWidth: '800px', marginTop: '2rem' }}>
                    {faqs.map((faq, index) => (
                        <FaqItem key={index} question={faq.question} answer={faq.answer} />
                    ))}
                </Box>
            </Box>
        </>
    );
}